// alert("外部js文件");

// 1 变量  存储单个可变信息的容器
// 声明变量  var 关键字
// 语法: var name = 值;
// 注意: 严格区分大小写
//       不以关键字 保留字 命名
//       不能以数字开始
//       不以汉字命名
//       可以是数字 字母 下划线 $拼接而成
//       建议驼峰式 userName


// 变量声明分两步:  1 声明变量   2 给变量赋值
// var $ ;
// $ = "1900元";

// // 声明且赋值
// // var a = 18;

// // 一次声明多个变量  使用一个var关键字   逗号 隔开
// var x = 15 , y = 20 , c = 30;

// js中的三种输出方式
// // 1 alert()  页面弹出框   会阻断向下执行
// alert("这是js的第一种输出方式 弹出")

// // 2 console.log()  控制台打印    用于开发人员查错
// console.log("这是js的第2种输出方式 控制台打印")

// // 3 document.write()  页面输出    都是字符串格式  - 即 写在单引号  或  双引号
// document.write("页面打印 hello javascript")

// var a = 10;
// var a = "hello";
// a = 45;

// console.log(a , b)